<?php

namespace App\Services\Info;

use App\Services\Utilites\Translit;

class Article
{

    public array $items = [
        [
            'title' => 'Квартира в новостройках Москвы, стоит ли покупать?',
            'photo' => 'build/images/article/1.webp',
            'description' => 'Давайте спросим ребенка, хочет ли он старый велосипед или новый? Нетрудно предсказать результаты опроса, не так ли? И если вы спросите взрослого об автомобиле, ответ будет уже не таким категоричным. Есть зависимость между возрастом и уровнем максимализма. Чем мы отличаемся от детей? Опытом.  Так мы называем красивую упаковку для ассортимента набитых шишек и потерь.  Посетив наш веб-сайт, вы сделали первый шаг к получению положительного опыта.


Какие существуют риски

Конечно, жутковато слушать новости или смотреть передачи про то, как снова кого-то обманули с купленной квартирой. В случае с недобросовестной строительной компанией, люди могут годами ждать желанной квартиры в новостройке, а могут и вовсе не дождаться. Но аварии на дорогах случаются чаще. К счастью, мы не перестаем любить автомобили. Мы учимся ими пользоваться у опытных инструкторов по вождению.

Инструкторами по вождению, точнее ведению сделки купли-продажи квартиры являются риелторы. Тем, что вы собираетесь сделать один раз в жизни, эти люди занимаются каждый день.

Тема взаимоотношений покупателя и агента очень актуальна именно при покупке первичной недвижимости, например, квартиры в новостройке, потому что это реально более рискованная сделка. В предприятиях, связанных с повышенным риском, лучше подстраховаться. Понятно, что купить газету с объявлениями быстрее и как будто проще. Но вот вы открыли разворот, везде красивые картинки, еще более красивые слова. Что же выбрать? Так не будет ли ваш выбор сродни ставке в казино? Поставить все на зеро или вовремя вспомнить, что вы ничего не знаете о застройщике, а красивые развороты ничего не гарантируют.



Почему лучше обратиться в агентство

В агентствах собирается и тщательно проверяется информация о каждом объекте строительства, строительных организациях, их руководстве, репутации (в фас и в профиль). Не скажем, что это делается из чисто христианского милосердия к клиенту.

• Но, во-первых, агентству проблемы не нужны. У него есть своя репутация и желание работать годами так, чтобы клиенты остались довольны, и в дальнейшем рекомендовали всем своим ближним и дальним обращаться только сюда.

• А, во-вторых, агентства сами покупают квартиры, в том числе в новостройках, создавая свой фонд для аренды или как инвестиции для выгодной продажи.

Первичной считается недвижимость, не прошедшая полное оформление во всех государственных органах. Даже если новый дом уже построен, но все бумаги не оформлены, он относится к сегменту первичной недвижимости. Правда, на самом последнем этапе свободных квартир в такой новостройке, как правило, уже нет, да и разница в цене при покупке минимальна.

Почему мы рискуем все-таки, покупая квартиры в незаконченном доме, зная о долгострое, банальных аферах, колебаниях цен на рынке, в результате чего не хватает денег закончить строительство? Потому что цены на недостроенные дома существенно ниже, чем на жилые: номинально на 20-40 %, реально квартира в новостройке может стоить на 60% дешевле, если деньги вложены еще на этапе котлована.

Преимуществами квартиры в новостройке является множество факторов: от современных стройматериалов до гораздо более удобной инфраструктуры дома. В новых домах просто невозможно купить квартиру, кухня в которой была бы по площади меньше 10 квадратных метров. А чего стоит экономия на ремонте при нынешних-то ценах на ремонт? Своя стоянка, огороженная и охраняемая территория, видеонаблюдение, лучшие места в городе. Это все квартиры в новостройках. Это жизнь по новым стандартам.'
        ],
        [
          'title' => 'Покупка квартиры в новостройке Москвы — советы по приобретению первичного жилья',
          'photo' => 'build/images/article/2.webp',
          'description' => 'Тенденции рынка первичной недвижимости показывают стабильный рост и развитие. При этом все большая часть людей предпочитает покупать квартиры в новостройке от застройщика. В помощь будущим домовладельцам собрано несколько экспертных рекомендаций, помогающих определиться с правильным выбором первичного жилья.


Задаем вопросы

Прежде чем приступать к изучению рынка недвижимости, узнайте, может кому-то из вашего окружения уже довелось купить квартиру в новостройке. Или они знают тех, кто приобретал жилье в новом доме. Всего лишь задавая вопросы уже можно найти:


• надежного застройщика;

• опытного агента по недвижимости;

• подходящие варианты квартир и др.


Полезно помнить! Общение с агентом, найденным через знакомых, многократно повышает шансы на получение правдивых ответов по интересующему жилью.


Изучаем рынок

Планомерное исследование рынка недвижимого имущества позволяет узнать массу полезной информации:


• сроки сдачи — для строящихся домов;

• данные о застройщике: отзывы, количество сданных домов;

• реальную среднерыночную стоимость квартиры в новостройке и др.


Все что не подходит, можно отбрасывать, а на приглянувшиеся варианты едем, смотрим.


Отсеиваем «выгодные» варианты

Полезно будет запомнить, что хорошие квартиры от официальных застройщиков точно не могут быть очень дешевыми. Надежные, зарекомендовавшие себя девелоперы, знают свою цену, так как покупка новостройки у них гарантирует:


• надежность;

• качество работ;

• выполнение сроков.


Поэтому средняя стоимость квартир в новостройке у именитых застройщиков немного выше среднерыночного показателя.


Молодые и слабые компании такого гаранта позволить себе не могут. Поэтому их вариант привлечения клиентов – выгода, сопряженная с рисками вроде долгостроя.


Проверяем документы застройщика


В первую очередь покупателю и его юристу следует изучить документы, которые способны подтвердить юридический статус застройщика и историю его проектов. В идеале у застройщика стоит запросить полный пакет таких документов:

документы, подтверждающие наименование, юридический и физический адрес застройщика;
документы со сведениями обо всех, кто является учредителем в компаниях, участвующих в строительстве. В них должно быть указано название юрлица-учредителя и ФИО учредителей, если это физические лица;
справка о том, что осуществлена госрегистрация (перерегистрация) юрлица;
лицензия, выданная проектной компании и разрешающая вести деятельность с целью организации процесса строительства и возведения жилых зданий;
проекты всех жилых домов, возведенных застройщиком в течение последних трех лет (тут же должно быть указано расположение этих объектов, точный срок введения каждого из них в эксплуатацию);
документы, которые подтверждают право компании на земельный участок (такое решение выдает акимат – он предоставляет право на землю);
заключение аудиторской компании, где проводится анализ деятельности по организации строительства жилых зданий компанией за последние 12 месяцев.
Изучение и проверка этих документов позволяют провести общую юридическую оценку благонадежности компаний, участвующих в строительстве. Но, прежде, чем требовать такой большой список нужно понимать, что далеко не все застройщики готовы, например, раскрывать структуру собственников и давать другие дополнительные документы. Больше потенциального покупателя должны интересовать документы по строящемуся объекту.


Оцениваем уровень продаж квартир

Как упоминалось, сильные, надежные застройщики пользуются спросом. Квартиры у них раскупают быстро. Первые клиенты приходят сразу после начала продаж.


Неудобное жилье и потенциальный долгострой раскупают неохотно. Поэтому, если после старта продаж прошло уже больше полугода, а агент говорит, что вам повезло в плане богатого ассортимента, есть повод задуматься о практической пользе подобной «удачи».


       6. Считаем построенные дома


Как и в большинстве отраслей, основной критерий качества – выполненные работы, на которые можно посмотреть. Поэтому, чтобы купить квартиру в новостройке от застройщика и не прогадать, в большей мере будущие домовладельцы ориентируются на портфолио девелоперов – готовые, построенные дома.


Есть несколько успешных проектов – хорошо. За плечами продажа квартир первичного жилья в десятке домов – выбор очевиден.


Важно! Отсутствие портфолио еще не повод отказываться от молодой компании. Построенные дома – это важный, но далеко не единственный критерий надежности застройщика.





Суть всех советов по покупке нового жилья основана на поиске и систематизации информации. Расспрашивая людей о купленном жилье можно узнать, насколько им нравится новая квартира, удобно ли там, как работают коммуникации и т. д.


Общение с менеджерами позволяет выяснить стоимость первичного жилья, подобрать приемлемые варианты. Также агент может рассказать все о планируемой и существующей инфраструктуре возле дома.


Полученную информацию раскладывайте по полочкам, взвешивайте за и против понравившихся вариантов и получайте решение. Если вы не желаете или не можете заниматься сбором данных, купить новую квартиру в Москве от застройщика с нужными параметрами помогут те же агенты и менеджеры.


Такой вид взаимодействия подразумевает оплату услуг и личную выгоду, поэтому подбирать специалиста нужно с осторожностью. Доверяйте четким, внятным ответам, подкрепленным фактами. Избегайте сотрудничества с лицами, отвечающими неохотно, расплывчато.


Полагайтесь на факты, интуицию, информацию и покупка квартиры новостройки пройдет для вас наилучшим образом.'
        ],
        [
            'title' => 'Почему в Москве выбор за новостройкой?',
            'photo' => 'build/images/article/3.webp',
            'description' => 'Постоянная миграция людей внутри города или всей Москвы заставляет менять свое место жительства, вот и приходится подбирать вариант в соответствии со своими запросами.


Однако в последнее время очень развита инфраструктура создания первичного рынка недвижимости или продажа квартир в новостройках. Народ тянется в большие города, особенно в столицу или в промышленные провинции, где люди могут получить достойную работу.


Строительные компании составляют план создания новых проектов и воплощают их в реальность, обеспечивая людей новой жилплощадью. По стоимости квартира в новом доме дешевле, чем предоставленное жилье на вторичном рынке. Эта разница может колебаться в пределах 15%.


Но, если вы хотите въехать в уже подготовленную к вашему проживанию квартиру с полным ремонтом и комфортными условиями – готовьте больше денег и ваше желание осуществится. Плюсы здесь очевидны — заселился и живешь.


Если вы считаете, что ремонт, интерьер квартиры, покупка мебели являются продолжением вашей личности – следуйте своему творческому потенциалу и начинайте прикидывать план последовательных действий и создавать свое личное пространство.


Последним веянием в вопросе о покупке недвижимости стало приобретение квартиры в новом жилом массиве, который находится за городом. Этот вариант удобен тем, у кого есть машина, иначе до муниципального транспорта добраться будет тяжело. Новых жильцов завлекают свежим воздухом, вдали от города. Кроме того, очень часто создают маленький городок со всеми удобствами для жильцов новых квартир: детская площадка, магазины, автостоянки, парки, развлекательные центры и другие, важные для жизни сооружения. Если повезет, к этому списку может присоединиться и школа или садик.


Въезжая в квартиру в новостройке, самое время проявить свой творческий талант и обустроить свое жилье самыми затейливыми идеями относительно интерьера: перестраивайте стены, утепляйтесь, стройте и создавайте.


А как приятно будет зайти в подъезд и увидеть новую краску на стенах, еще блестящую и свежую, а не облущенную, которую красили около 20 лет назад. То же касается и лифта, более современного и усовершенствованного.


Если хотите начать жизнь с самого начала после переезда – надо купить квартиру в новостройке, ведь аура, которая создается в помещении, будет только вашей.

'
        ],
        [
            'title' => 'Черновые этапы ремонта в новостройке',
            'photo' => 'build/images/article/4.webp',
            'description' => 'Впервые столкнувшись с ремонтом, в голове любого человека возникает огромное количество вопросов. Особенно, если ремонт необходимо делать в новостройке, первый раз в жизни. Все потому, что он имеет ряд отличий и особенностей от ремонта в обжитой квартире.


С чего начинать ремонт в новостройке?


Не совсем черновой этап, но немало важный, который нельзя пропускать. Первый шаг – это визуализация желаний и оценка возможностей. Необходимо понимать, какой должна стать квартира после ремонта. В интернете существует множество онлайн-программ, которые помогут спланировать расстановку мебели, задать цвета стен, плитки и т. д. Более дорогой, но не менее надежный вариант – это помощь дизайнера. Большинство специалистов в этой области не только перенесут ваши предпочтения и общие пожелания на картинку, но и рассчитают количество необходимых материалов. Среди них:


- Плитка;

- Обои;

- Краска;

- Ламинат и пр.


Кроме перечисленного, дизайнер предоставит схемы разводки сантехники и электрики, если в квартире таковые отсутствуют на момент начала ремонта.


Перепланировка


После консультации с дизайнером, уже, наверняка, будет принято решение о том, стоит ли «переносить», «убирать», «добавлять» стены. Межкомнатные перегородки, как правило, возводятся из кирпича в один ряд или пазогребневых плит. Последние имеют не самую лучшую звукоизоляцию, но при этом имеют привлекательную цену и удобство в монтаже.


Разводка электрики и сантехники


Если в квартире нет разводки сантехники и электрики, тогда это следующий шаг, который необходимо сделать новым собственникам жилья. Эта работа достаточно пыльная и грязная, поэтому ее делают в самом начале ремонта. На этом же этапе электрик должен провести интернет и тв-кабель. Если в дальнейшем планируется установка сигнализации, специалистов с охранной фирмы желательно так же пригласить на этом этапе.


Стяжка пола


Большинство новостроек сдаются уже с готовой машинной стяжкой. Вопрос ее качества – это совесть застройщика. После получения ключей, стоит пригласить специалиста, который оценит необходимость выравнивания пола. Так же на этапе строительства можно уведомить застройщика о том, где планируется укладка теплого пола. Ввиду этого, стяжка в тех местах не будет залита, что даст возможность сэкономить деньги на ее демонтаже.


Подготовка стен


Рассказы строительных компаний о том, что квартира сдается с идеально ровными стенами, в большинстве случаев неправда. Первая встреча с маляром будет тому подтверждением. Поэтому, штукатурно-малярные работы, монтаж арматурной сетки, шпаклевка, грунтовка стен – то, что предстоит пережить новым владельцам.


Потолок


Все зависит от того, установка какого вида потолка планируется в квартире. Если это подвесной гипсокартонный потолок – то, его установка происходит на этапе подготовки стен. То же самое касается и натяжного тканевого потолка, так как красится он после того, как его натянут. Пленочный потолок можно устанавливать даже на завершающем этапе ремонта.


На этом все черновые работы считаются оконченными. Следующий шаг – это отделка квартиры. Более интересный и кропотливый процесс, который принесет намного больше удовольствия и приблизит финиш ремонта.

'
        ],
        [
            'title' => 'Как выбрать квартиру в новостройке?',
            'photo' => 'build/images/article/5.webp',
            'description' => 'Часто долгий и почти всегда тернистый путь к собственному уютному гнёздышку у каждого свой. Будь то ипотека, длительная экономия для накопления необходимой суммы или обмен уже имеющихся помещений, рано или поздно наступает, пожалуй, самый приятный момент - выбор самой квартиры. Если предполагается приобретение квадратных метров в новостройке, то даже в рамках одного объекта недвижимости выбор этот может быть огромен. Для покупки наиболее оптимального варианта необходимо оценить несколько параметров.


Этаж

Наименее комфортным для проживания, но при этом самым дешёвым является первый этаж. Второй ценится выше, но лучше покупать недвижимость, начиная с третьего. В современных домах последние этажи часто стоят дороже из-за высоких потолков и иногда красивых видов из окон. Правда это относится только к домам, оборудованным лифтом. Иногда квартиры на последнем этаже располагают возможностью установки камина.


Окружение

При выборе жилья часто забывают уточнить, какие помещения окружают квартиру. Если за стеной, например, спальни разместилась маленькая студия или соседская кухня, то от такого варианта лучше отказаться. Засыпать под аккомпанемент гремящей посуды - не самая приятная перспектива. Даже при хорошей шумоизоляции стен громкие звуки будут доставлять неудобство. Не самое приятное соседство может быть с магазином, расположенным этажом ниже: постоянный шум от разгружаемых машин. Многие скептически относятся к угловым квартирам, утверждая, что они промерзают. Это верно для старого фонда. Жители современных домов с такой проблемой практически не сталкиваются, а потому такое жильё выигрывает с точки зрения высокой степени изоляции от соседей.


Наличие подсобных помещений

В Москве принято оценивать недвижимость по общей и жилой площади. Жилой считается площадь комнат, а если к ней добавить коридор, кухню, санузлы, кладовые, балконы и лоджии, то получится общая площадь. На первый взгляд кажется, что чем больше жилая площадь, тем лучше. Но если на плане несколько огромных комнат, но маленькая кухня, нет кладовки и в коридоре не разминуться двоим, то без проведения перепланировки будет сложно организовать полноценные места для хранения. Наличие большого угловатого коридора тоже малоэффективно: покупатель платит за квадратные метры, которые потом не будут использованы. Таким образом при оценке данного параметра следует хотя бы концептуально определить, где будет гардероб и место для хранения бытового инвентаря, количество которого часто недооценивается, как будет использоваться площадь балконов и коридоров.


Планировка и форма комнат

Фантазия современных архитекторов не знает границ. Замысловатые формы домов становятся причиной нестандартных и порой не самых удачных планировок. Жильё с острыми углами или округлой стеной, колонны, несколько вытянутых комнат - все это возможно обыграть, но придётся серьёзно пофантазировать. Принято считать, что чем ближе форма комнаты к квадрату, тем лучше. Данное утверждение верно, если не предполагается зонирование помещения как, например, это часто делают в студиях: выделяют зону кухни и жилую зону.


Вид из окна

Когда стоит вопрос выбора новостройки, особенно в случае бюджетного варианта, данному параметру не уделяется должного внимания. И совершенно напрасно. В одном и том же доме варианты на одном этаже с одинаковыми планировками могут отличаться в цене. И если при покупке нового жилья эта разница незначительна, то в дальнейшем разрыв стоимости вырастет до нескольких сотен рублей. Поэтому очень важно на этапе принятия решения уточнить, на что открывается вид из окон: на парк, во двор, а может быть на ЛЭП или площадку сбора твёрдых бытовых отходов. Немаловажно оценить и стороны света. Жилье со всеми окнами на север или северо-запад никогда не будет наполнено солнцем. В целом, более удачной считается недвижимость, комнаты в которой выходит на разные стороны, такие помещения лучше проветриваются.



Покупая квадратные метры, следует помнить, что квартира - это индивидуальное жилье, а потому данный перечень параметров не только не является исчерпывающим, но также не может быть отнесен к истине в последней инстанции. Индивидуальные особенности жильцов формируют уникальный список требований и оцениваемых характеристик. Важно подойти к выбору осознанно и сформировать этот список до момента покупки квартиры.'
        ]
    ];


    public function getList(): array
    {
        foreach ($this->items as $item) {
            $code = Translit::translit($item['title']);
            $item['code'] = $code;
            $data[$code] = $item;
        }

        return $data ?? [];
    }

    public function get(string $code): array
    {
        $items = $this->getList();

        return $items[$code];
    }
}